Repository: un-pogaz/Comments-Mass-Search-Replace
Catalog: translations/*.po
Languages: es

source: Easily apply a list of multiple saved Find and Replace operations to your books metadata
es: Aplica fácilmente una lista de múltiples operaciones de Buscar y Reemplazar guardadas a los metadatos de tus libros

source: Apply a list of multiple saved Find and Replace operations
es: Aplicar una lista de múltiples operaciones guardadas de Buscar y Reemplazar

source: &Quick Search/Replace…
es: &Rápido Buscar/Reemplazar…

source: &Selection
es: &Selección

source: &Current search
es: Búsqueda &actual

source: &Virtual library
es: Biblioteca &virtual

source: &Library
es: &Biblioteca

source: &Customize plugin…
es: &Personalizar complemento…

source: the selected books
es: los libros seleccionados

source: all books in the library {:s}
es: todos los libros de la biblioteca {:s}

source: the virtual library {:s}
es: la biblioteca virtual {:s}

source: the current search
es: la búsqueda actual

source: ({:d} books)
es: ({:d} libros)

source: Invalide menu configuration, the "{:s}" key is missing.
es: Configuración de menú no válida, falta la tecla "{:s}".

source: {PLUGIN_NAME} progress
es: {PLUGIN_NAME} progreso

source: Search/Replace {:d} of {:d}. Book {:d} of {:d}.
es: Buscar/Reemplazar {:d} de {:d}. Libro {:d} de {:d}.

source: Invalid operation
es: Operación no válida

source: A invalid operations has detected: {:s} Mass Search/Replace was canceled.
es: Se ha detectado una operación no válida: {:s} Se canceló Mass Search/Replace.

source: The library a was restored to its original state.
es: La biblioteca a fue restaurada a su estado original.

source: Cannot update the library
es: No se puede actualizar la biblioteca

source: Exceptions during the library update
es: Excepciones durante la actualización de la biblioteca

source: {:d} exceptions have occurred during the library update. Some fields may not have been updated.
es: {:d} se han producido excepciones durante la actualización de la biblioteca. Es posible que algunos campos no se hayan actualizado.

source: {:d} invalid operations has detected and have been ignored.
es: {:d} operaciones no válidas han sido detectadas y han sido ignoradas.

source: Update Report
es: Informe de actualización

source: Mass Search/Replace performed for {:d} books with a total of {:d} fields modify.
es: Mass Search/Replace realizado para {:d} libros con un total de {:d} campos modificados.

source: A invalid operations has detected: {:s} Continue the execution of Mass Search/Replace? Other errors may exist and will be ignored.
es: Se ha detectado una operación no válida: {:s} ¿Continuar la ejecución de Mass Search/Replace? Pueden existir otros errores y serán ignorados.

source: Update the library for {:d} books with a total of {:d} fields…
es: Actualizar la biblioteca para {:d} libros con un total de {:d} campos…

source: You cannot configure this plugin before calibre is restarted.
es: No puede configurar este complemento antes de reiniciar calibre.

source: Keyboard shortcuts
es: Atajos de teclado

source: Edit the keyboard shortcuts associated with this plugin
es: Editar los atajos de teclado asociados con este complemento

source: Preferences for:
es: Preferencias para:

source: Clear all settings for this plugin
es: Borrar todas las configuraciones para este complemento

source: The changes cannot be applied.
es: Los cambios no se pueden aplicar.

source: Are you sure you want to change your settings in this library for this plugin?
es: ¿Está seguro de que desea cambiar su configuración en esta biblioteca para este complemento?

source: Any settings in other libraries or stored in a JSON file in your calibre plugins folder will not be touched.
es: Cualquier configuración en otras bibliotecas o almacenada en un archivo JSON en su carpeta de complementos de calibre no se modificará.

source: Are you sure you want to clear your settings in this library for this plugin?
es: ¿Está seguro de que desea borrar su configuración en esta biblioteca para este complemento?

source: View library preferences
es: Ver preferencias de biblioteca

source: View data stored in the library database for this plugin
es: Ver datos almacenados en la base de datos de la biblioteca para este complemento

source: Cancel
es: Cancelar

source: Book {:d} of {:d}
es: Libro {:d} de {:d}

source: Copy to clipboard
es: Copiar al portapapeles

source: Add New Image
es: Agregar nueva imagen

source: &Select image source
es: &Seleccionar fuente de imagen

source: From &web domain favicon
es: Desde &dominio web favicon

source: From .png &file
es: Desde &archivo .png

source: &Save as filename:
es: &Guardar como nombre de archivo:

source: Select a .png file for the menu icon
es: Seleccione un archivo .png para el icono del menú

source: Cannot import image
es: No se puede importar la imagen

source: Source image must be a .png file.
es: La imagen de origen debe ser un archivo .png.

source: You must specify a filename to save as.
es: Debe especificar un nombre de archivo para guardar como.

source: The save as filename should consist of a filename only.
es: Guardar como nombre de archivo debe consistir solo en un nombre de archivo.

source: Are you sure?
es: ¿Estás seguro?

source: An image with this name already exists - overwrite it?
es: Ya existe una imagen con este nombre. ¿Sobrescribirla?

source: You must specify a web domain url
es: Debe especificar una URL de dominio web

source: You must specify a source file.
es: Debe especificar un archivo fuente.

source: Source image does not exist!
es: ¡La imagen de origen no existe!

source: The {PLUGIN_NAME} plugin has encounter a unhandled exception.
es: El complemento {PLUGIN_NAME} ha encontrado una excepción no controlada.

source: Unhandled exception
es: Excepción no controlada

source: Select a ZIP archive file to import…
es: Seleccione un archivo ZIP para importar…

source: Save ZIP archive file as…
es: Guardar archivo ZIP como…

source: Select a JSON file to import…
es: Seleccione un archivo JSON para importar…

source: Save the JSON file as…
es: Guardar un archivo JSON como…

source: Could not to launch {:s}
es: No se pudo iniciar {:s}

source: No book selected
es: Ningún libro seleccionado

source: No book in the library
es: No hay libro en la biblioteca

source: No book in the virtual library
es: No hay libro en la biblioteca virtual

source: No book in the current search
es: Ningún libro en la búsqueda actual

source: Unknown
es: Desconocido

source: Template Error
es: Error de plantilla

source: Running the template returned an error:
es: Ejecutar la plantilla devolvió un error:

source: Enter a template to test using data from the selected book
es: Ingrese una plantilla para probar usando datos del libro seleccionado

source: Template editor
es: Editor de plantilla

source: Open the template editor
es: Abrir el editor de plantillas

source: Restart required
es: Reinicio requerido

source: Title image not found - you must restart Calibre before using this plugin!
es: No se encontró la imagen del título. ¡Debe reiniciar Calibre antes de usar este complemento!

source: Undefined
es: Indefinido

source: Subset of values associate to the books
es: Subconjunto de valores asociados a los libros

source: No books
es: Sin libros

source: {:d} books (no values)
es: {:d} libros (sin valores)

source: {:d} books
es: Sin notas

source: No notes
es: Agregar nueva imagen…

source: Add New Image…
es: Agregar nueva imagen…

source: Interrupt execution
es: Interrumpir la ejecución

source: Stop Mass Search/Replace and display the error normally without further action.
es: Detener Mass Search/Replace y mostrar el error normalmente sin más acción.

source: Restore the library
es: Restaurar la biblioteca

source: Stop Mass Search/Replace and restore the library to its original state.
es: Detener Mass Search/Replace y restaurar la biblioteca a su estado original.

source: Updates the fields one by one. This operation can be slower than other strategies.
es: Actualiza los campos uno por uno. Esta operación puede ser más lenta que otras estrategias.

source: Carefully executed (slower)
es: Cuidadosamente ejecutado (más lento)

source: When a error occurs, stop Mass Search/Replace and display the error normally without further action.
es: Cuando ocurre un error, detenga Mass Search/Replace y muestre el error normalmente sin más acción.

source: Don't stop (slower, not recomanded)
es: No detenerse (más lento, no recomendado)

source: Update the library, no matter how many errors are encountered. The problematics fields will not be updated.
es: Actualice la biblioteca, sin importar cuántos errores se encuentren. Los campos problemáticos no se actualizarán.

source: Abbort
es: Abortar

source: If an invalid operation is detected, abort the changes.
es: Si se detecta una operación no válida, cancele los cambios.

source: Asked
es: Pregunta

source: If an invalid operation is detected, asked whether to continue or abort the changes.
es: Si se detecta una operación inválida, pregunta si continuar o cancelar los cambios.

source: Hidden
es: Oculto

source: Ignore all invalid operations.
es: Ignorar todas las operaciones inválidas.

source: Select and configure the menu items to display:
es: Seleccione y configure los elementos del menú para mostrar:

source: Move menu item up
es: Mover elemento de menú hacia arriba

source: Add menu item
es: Agregar elemento de menú

source: Copy menu item
es: Copiar elemento de menú

source: Delete menu item
es: Eliminar elemento de menú

source: Move menu item down
es: Mover elemento de menú hacia abajo

source: Mark the updated books
es: Marcar los libros actualizados

source: Display a update report
es: Mostrar un informe de actualización

source: Error strategy
es: Estrategia de error

source: Define the strategy when a error occurs during the library update
es: Defina la estrategia cuando ocurra un error durante la actualización de la biblioteca

source: Name
es: Nombre

source: Submenu
es: Submenú

source: Image
es: Imagen

source: Operation
es: Operación

source: &Add image…
es: &Agregar imagen…

source: &Open images folder
es: &Abrir carpeta de imágenes

source: &Import…
es: &Importar…

source: &Export…
es: &Exportar…

source: Import failed
es: Importación fallida

source: This is not a valid OWIP export archive
es: Este no es un archivo de exportación OWIP válido

source: Import completed
es: Importación completada

source: {:d} menu items imported
es: {:d} elementos de menú importados

source: Select a menu file archive to import…
es: Seleccione un archivo de menú para importar…

source: Export failed
es: Exportación fallida

source: No menu items selected to export
es: No hay elementos de menú seleccionados para exportar

source: Export completed
es: Exportación completada

source: {:d} menu items exported to {:s}
es: {:d} elementos de menú exportados a {:s}

source: Save menu archive as…
es: Guardar archivo de menú como…

source: (copy)
es: (copiar)

source: Are you sure you want to delete this menu item?
es: ¿Está seguro de que desea eliminar este elemento del menú?

source: Are you sure you want to delete the selected {:d} menu items?
es: ¿Está seguro de que desea eliminar los elementos de menú {:d} seleccionados?

source: {:d}/{:d} operations
es: {:d}/{:d} operaciones

source: {:d} operations
es: {:d} operaciones

source: This operations list contain a error
es: Esta lista de operaciones contiene un error

source: Edit the operations list
es: Editar la lista de operaciones

source: Columns
es: Columnas

source: Template
es: Plantilla

source: Search mode
es: Modo de busqueda

source: Search
es: Buscar

source: Replace
es: Reemplazar

source: List of operations for a quick Search/Replaces
es: Lista de operaciones para una búsqueda/reemplazo rápido

source: List of Search/Replace operations for {:s}
es: Lista de operaciones de búsqueda/reemplazo para {:s}

source: Select and configure the order of execution of the operations of Search/Replace operations:
es: Seleccione y configure el orden de ejecución de las operaciones de búsqueda/reemplazo:

source: Move operation up
es: Mover la operación hacia arriba

source: Add operation
es: Agregar operación

source: Copy operation
es: Copiar operación

source: Delete operation
es: Eliminar operación

source: Move operation down
es: Mover la operación hacia abajo

source: This is not a valid JSON file
es: Este no es un archivo JSON válido

source: {:d} operations imported
es: {:d} operaciones importados

source: No operations selected to export
es: No se seleccionaron operaciones para exportar

source: {:d} operations exported to {:s}
es: {:d} operaciones exportadas a {:s}

source: Save the operations as…
es: Guardar las operaciones como…

source: Are you sure you want to delete this operation?
es: ¿Está seguro de que desea eliminar esta operación?

source: Are you sure you want to delete the selected {:d} operations?
es: ¿Está seguro de que desea eliminar las operaciones {:d} seleccionadas?

source: Error Strategy
es: Estrategia de error

source: Set the strategy when an invalid operation has detected:
es: Establecer la estrategia cuando se detecte una operación no válida:

source: Define the strategy when a error occurs during the library update:
es: Defina la estrategia cuando ocurra un error durante la actualización de la biblioteca:

source: Invalid operation, the "{:s}" key is missing.
es: Operación no válida, falta la tecla "{:s}".

source: Search field "{:s}" is not available for this library
es: El campo de búsqueda "{:s}" no está disponible para esta biblioteca

source: Destination field "{:s}" is not available for this library
es: El campo de destino "{:s}" no está disponible para esta biblioteca

source: Identifier type "{:s}" is not available for this library
es: El tipo de identificador "{:s}" no está disponible para esta biblioteca

source: Configuration of a Search/Replace operation
es: Configuración de una operación de Buscar/Reemplazar

source: The registering of Find/Replace operation has failed. {:s} Do you want discard the changes?
es: Ha fallado el registro de la operación Buscar/Reemplazar. {:s} ¿Quieres descartar los cambios?

source: You must specify a "Search field"
es: Debes especificar un "campo de búsqueda"

source: Case to be applied
es: Aplicar mayúsculas

source: Replace mode
es: Modo de reemplazo

source: Identifier type
es: Tipo de identificador

source: Replace field
es: Reemplazar campo

source: In field replacement mode, the specified field is set to the text and all previous values are erased. After replacement is finished, the text can be changed to upper-case, lower-case, or title-case.
es: En el modo de reemplazo de campo, el campo especificado se establece en el texto y todos los valores anteriores se borran. Una vez que finaliza el reemplazo, el texto se puede cambiar a mayúsculas, minúsculas o título.

source: Invalid identifier string. It must be a comma-separated list of pairs of strings separated by a colon.
es: Cadena de identificador no válida. Debe ser una lista separada por comas de pares de cadenas separadas por dos puntos.

source: The field "{:s}" is not defined
es: El campo "{:s}" no está definido

source: The operation field "{:s}" contains a invalid value ({:s}).
es: El campo de operación "{:s}" contiene un valor no válido ({:s}).

source: The value of this field is localized (translated). This can cause problems when using settings shared on internet or when changing the user interface language.
es: El valor de este campo está localizado (traducido). Esto puede causar problemas al usar configuraciones compartidas en Internet o al cambiar el idioma de la interfaz de usuario.
